import './page.css';

const Docs = () => {
  return (
    <div className="page page-animate">
      <h1>Положение об автобазе</h1>
      <p></p>
      <h2>1 .Общее положения</h2>
      <p>1.1. Автобаза является структурным подразделением управления эксплуатации и благоустройства (далее - Управление) федерального государственного бюджетного образовательного учреждения "Всероссийский детский центр"Океан" (далее - Центр) и непосредственно подчиняется начальнику Управления.</p>
      <p>1.2. Работники автобазы назначаются на должность и освобождаются от должности на основании приказа директора Центра.</p>
      <p>1.3. Автобаза в своей деятельности руководствуется Конституцией Российской Федерации, федеральными конституционными законами, федеральными законами, указами и распоряжениями Президента Российской Федерации, постановлениями и распоряжениями Правительства Российской Федерации, нормативными правовыми актами федеральных органов исполнительной власти, организационно-распорядительными актами Министерства просвещения Российской Федерации, актами Министерства транспорта Российской Федерации, Уставом автомобильного транспорта и городского наземного электрического транспорта, правилами технической эксплуатации транспорта, учредительными документами и локальными нормативными актами Центра, Управления, а также настоящим положением.</p>
      <p>1.4. Автобаза осуществляет свою деятельность во взаимодействии с другими структурными подразделениями Центра и Управления, органамиисполнительной власти, органами местного самоуправления, Министерством просвещения Российской Федерации, Министерством транспорта Российской Федерации, Федеральным дорожным агентством, Военным комиссариатом, правоохранительными органами, общественными объединениями и иными организациями всех форм собственности.</p>
      <h2>2. Структура</h2>
      <p>2.1. Структуру и штатную численность автобазы, являющейся неотъемлемой частью Управления, утверждает директор Центра.</p>
      <p>2.2. Руководство автобазой осуществляет заместитель начальника управления - начальник автобазы управления эксплуатации и благоустройства (далее - начальник автобазы).</p>
      <h2>3. Основные задачи</h2>
      <p>3.1. Обеспечение выполнения перевозок пассажиров (грузов) при рациональном и эффективном использовании подвижного состава и соблюдении требований безопасности дорожного движения.</p>
      <p>3.2. Организация бесперебойного транспортного обслуживания подразделений Центра и учреждения в целом для обеспечения ритмичной работы при наименьших затратах.</p>
      <p>3.3. Совершенствование работы, улучшение использования транспортных средств, повышение их экономичности.</p>
      <p>3.4. Эффективное использование расходов Центра, модернизация, дооборудование, (оснащение) транспортных средств в рамках действующего законодательства.</p>
      <p>3.5. Организация делопроизводства в автобазе в соответствии с утвержденной номенклатурой, обеспечение учета и сохранности документов, связанных с деятельностью автобазы и Управления.</p>
      <h2>4. Функции</h2>
      <p>4.1. Организовывает эксплуатацию автотранспортных средств, ежедневный выход автомобилей, способствует максимальному удовлетворению заявок на автотранспортное обслуживание.</p>
      <p>4.2. Участвует в перспективном и текущем планировании:</p>
      <p>- использования, эксплуатации, технического обслуживания, сдержания, ремонта и хранения автотранспортных средств;</p>
      <p>- мероприятий по поддержанию и готовности автотранспортных средств к эффективному целевому использованию по назначению</p>
      <p>- мероприятий по внедрению безаварийных методов работы автотранспорта и специальной техники, экономии бюджетных средств на одержание автомобильной техники.</p>
      <p>4.3. Содержание автотранспортных средств в надлежащем, технически исправном состоянии.</p>
      <p>4.4. Организует проведение технического обслуживания, текущего, среднего и в исключительных случаях капитального ремонта автотранспортных средств на собственной ремонтно-технической базе.</p>
      <p>4.5. Своевременное обеспечение автобазы горюче-смазочными материалами, топливом, шинами, запасными частями, инструментом и другими эксплуатационными материалами.</p>
      <p>4.6. Ведет базу данных о наличии, состоянии и движении автотранспортных средств, а также потребности в них.</p>
      <p>4.7. Обеспечение транспортного обслуживания Центра.</p>
      <p>4.8. Ведет документацию о годовых, квартальных и месячных нормах расхода ресурсов (пробега) автомобилей, нормах расхода топлива, об организации эксплуатации, технического обслуживания, ремонта, хранения и использования автотранспортных средств, а также других документов по указанным направлениям деятельности.</p>
      <p>4.9. Осуществляет непрерывный мониторинг информации относительно передвижения транспорта, местоположения, пройденного километража, расхода топлива, контроль слива топлива и заправок транспортных средств автобазы через установленное специализированное программное обеспечение.</p>
      <p>4.10. Утверждает оптимальные маршруты следования.</p>
      <p>4.11. Осуществляет контроль над соблюдением водителями правил технической эксплуатации автотранспорта.</p>
      <p>4.12. Закрепляет автотранспортные средства за водительским составом.</p>
      <p>4.13. Проводит анализ причин совершения дорожно-транспортных происшествий (ДТП), разработку мероприятий, рекомендаций, направленных на сокращение числа ДТП и повышение уровня безопасности дорожного движения.</p>
      <p>4.14. Организует и осуществляет контроль профессиональной подготовки работников автобазы.</p>
      <p>4.15. Принимает под материальную ответственность автотранспортные средства и другие материальные запасы.</p>
      <p>4.16. Инициирует заключение договоров и проведение закупок конкурентным способом.</p>
      <p>4.17. Разрабатывает и осуществляет мероприятия по развитию, оснащению и повышению эффективности использования собственной ремонтно-технической базы, по рациональному расходованию горюче-смазочных материалов, материальных и финансовых ресурсов.</p>
      <p>4.18. Взаимодействует с территориальными органами федеральных органов исполнительной власти по вопросам безопасности дорожного движения, проведения технических осмотров автотранспортных средств, допуска их к эксплуатации, расследования и профилактики ДТП.</p>
      <p>4.19. Ведет учет необходимых нормативных и иных правовых актов, регламентирующих эксплуатацию автотранспортных средств.</p>
      <p>4.20. Участвует в подготовке материалов о списании автотранспортных средств, с баланса Центра, об их передаче сторонним организациям, о реализации автотранспортных средств, автомобильного имущества и гражданского оборудования.</p>
      <p>4.21. Осуществляет мероприятия по соблюдению на автобазе правил пожарной безопасности и охраны труда.</p>
      <h2>5. Права</h2>
      <p>Автобаза для решения возложенных на неё задач имеет право:</p>
      <p>5.1. Представлять в установленном порядке Центр в других организациях но вопросам, относящимся к производственной деятельности автобазы.</p>
      <p>5.2. Требовать и получать от руководителей структурных подразделений Центра представления необходимых сведений, материалов и документов, необходимых для осуществления работы и планирования работы, входящей в компете!iцию автобазы.</p>
      <p>5.3. Ежемесячно проводить анализ хозяйственной и экономической деятельности подразделений, связанных с использованием транспортных средств, и давать предложения руководству Центра о поощрении или наложении взыскания на работников этих подразделений.</p>
      <p>5.4. Подготавливать проекты приказов и распоряжений по Центру, а также инструктивные документы по вопросам связанных с работой транспорта.</p>
      <p>5.5. Вносить предложения по выбору и расстановке работников, отвечающих за работу транспорта в подразделении.</p>
      <p>5.6. Проводить индивидуальные собеседования, инструктажи, рабочие совещания по обсуждению вопросов, входящих в компетенцию автобазы.</p>
      <h2>6. Ответственность</h2>
      <p>6.1. Всю полноту ответственности за качество и своевременность выполнения возложенных настоящим Положением на автобазу задач и функций несет начальник автобазы.</p>
      <p>6.2. Степень ответственности других сотрудников автобазы устанавливается должностными инструкциями.</p>
      <p>6.3. Начальник и другие сотрудники автобазы несут персональную ответственность за соответствие визируемых ими документов законодательству Российской Федерации и иных нормативных правовых актов.</p>
      <h2>7. Организационная деятельность</h2>
      <p>7.1. Начальник автобазы подчиняется непосредственно начальнику Управления.</p>
      <p>7.2. Нрава и обязанности начальника автобазы установлены настоящим Положением, трудовым договором и должностной инструкцией.</p>
      <p>7.3. Начальник автобазы:</p>
      <p>7.3.1. Осуществляет общее руководство деятельностью автобазы.</p>
      <p>7.3.2. Несёт персональную ответственность за выполнение возложенных на автобазу задач и функций.</p>
      <p>7.3.3. Распределяет обязанности между сотрудниками автобазы.</p>
      <p>7.3.4. Обеспечивает рациональное распределение нагрузки между сотруД11 и кам и а втобазы.</p>
      <p>7.3.5. Планирует работу автобазы и контролирует ее выполнение.</p>
      <p>7.3.6. Контролирует соблюдение сотрудниками автобазы правил внутреннего трудового распорядка автобазы.</p>
      <p>7.3.7. Соблюдает правила охраны труда и пожарной безопасности.</p>
      <p>7.3.8. Осуществляет контроль за соблюдением правил пожарной безопасности в своем структурном подразделении.</p>
      <h2>8. Критерии оценки деятельности</h2>
      <p>8.1. Своевременное и качественное выполнение поставленных задач и функций автобазы.</p>
      <p>8.2. Качественное исполнение должностных обязанностей сотрудниками автобазы</p>
      <div className="copyright">&copy; Максим Фадеев, гр.ЭФБО-02-22, МИРЭА</div>
    </div>    
  );
};

export default Docs;