import './Car.css';

const CarCard = ({ auto_id, auto_firma, auto_model, auto_type, state_number, fuel, azs, savedCar, selAzsCarID, setSelectedAZS, onEditCar, onDelCar }) => {

  return (
    <div className={`car-card carlist-animate ${savedCar.auto_id===auto_id?'is-updated-car':''}`} key={auto_id}>
      <h3>{auto_firma} {auto_model}</h3>
      <p>Тип: {auto_type}</p>
      <p>Номер: <span className="car-number">{state_number}</span></p>
      <p>Топливо: {fuel}</p>
      <svg className={`car-card-fuel ${!azs.length?'car-card-fuel-error':''} ${selAzsCarID===auto_id ? 'car-card-fuel-sel' : ''}`} xmlns="http://www.w3.org/2000/svg" viewBox="0 0 48 48" onClick={ () => setSelectedAZS(auto_id, azs) } disabled={!azs.length}>
        <title>Показать АЗС</title>
        <path d="M0 0h48v48h-48z" fill="none" />
        <path d="M39.54 14.46l.03-.03-7.45-7.43-2.12 2.12 4.22 4.22c-1.88.72-3.22 2.53-3.22 4.66 0 2.76 2.24 5 5 5 .71 0 1.39-.15 2-.42v14.42c0 1.1-.9 2-2 2s-2-.9-2-2v-9c0-2.21-1.79-4-4-4h-2v-14c0-2.21-1.79-4-4-4h-12c-2.21 0-4 1.79-4 4v32h20v-15h3v10c0 2.76 2.24 5 5 5s5-2.24 5-5v-19c0-1.38-.56-2.63-1.46-3.54zm-15.54 5.54h-12v-10h12v10zm12 0c-1.1 0-2-.9-2-2s.9-2 2-2 2 .9 2 2-.9 2-2 2z"/>
      </svg>      
      <svg className="edit-button" xmlns="http://www.w3.org/2000/svg" version="1.1" width="24" height="24" viewBox="0 0 100 100" onClick={()=>onEditCar(auto_id)}>
      <title>Редактировать автомобиль</title>
      <path d="M77.926,94.924H8.217C6.441,94.924,5,93.484,5,91.706V21.997c0-1.777,1.441-3.217,3.217-3.217h34.854 c1.777,0,3.217,1.441,3.217,3.217s-1.441,3.217-3.217,3.217H11.435v63.275h63.274V56.851c0-1.777,1.441-3.217,3.217-3.217 c1.777,0,3.217,1.441,3.217,3.217v34.855C81.144,93.484,79.703,94.924,77.926,94.924z"/>
      <path d="M94.059,16.034L84.032,6.017c-1.255-1.255-3.292-1.255-4.547,0l-9.062,9.073L35.396,50.116 c-0.29,0.29-0.525,0.633-0.686,1.008l-7.496,17.513c-0.526,1.212-0.247,2.617,0.676,3.539c0.622,0.622,1.437,0.944,2.274,0.944 c0.429,0,0.858-0.086,1.276-0.257l17.513-7.496c0.375-0.161,0.719-0.397,1.008-0.686l35.026-35.026l9.073-9.062 C95.314,19.326,95.314,17.289,94.059,16.034z M36.286,63.79l2.928-6.821l3.893,3.893L36.286,63.79z M46.925,58.621l-5.469-5.469 L73.007,21.6l5.47,5.469L46.925,58.621z M81.511,24.034l-5.469-5.469l5.716-5.716l5.469,5.459L81.511,24.034z"/></svg>
      <svg className="del-button" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110.61 122.88" onClick={()=>onDelCar(auto_id)}><title>Удалить автомобиль</title><path d="M39.27,58.64a4.74,4.74,0,1,1,9.47,0V93.72a4.74,4.74,0,1,1-9.47,0V58.64Zm63.6-19.86L98,103a22.29,22.29,0,0,1-6.33,14.1,19.41,19.41,0,0,1-13.88,5.78h-45a19.4,19.4,0,0,1-13.86-5.78l0,0A22.31,22.31,0,0,1,12.59,103L7.74,38.78H0V25c0-3.32,1.63-4.58,4.84-4.58H27.58V10.79A10.82,10.82,0,0,1,38.37,0H72.24A10.82,10.82,0,0,1,83,10.79v9.62h23.35a6.19,6.19,0,0,1,1,.06A3.86,3.86,0,0,1,110.59,24c0,.2,0,.38,0,.57V38.78Zm-9.5.17H17.24L22,102.3a12.82,12.82,0,0,0,3.57,8.1l0,0a10,10,0,0,0,7.19,3h45a10.06,10.06,0,0,0,7.19-3,12.8,12.8,0,0,0,3.59-8.1L93.37,39ZM71,20.41V12.05H39.64v8.36ZM61.87,58.64a4.74,4.74,0,1,1,9.47,0V93.72a4.74,4.74,0,1,1-9.47,0V58.64Z"/></svg>
    </div>
  );
};

export default CarCard;